rails-blog/app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "body", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Test"], ["body", "Test"], ["user_id", 11], ["created_at", "2019-03-31 22:37:24.501943"], ["updated_at", "2019-03-31 22:37:24.501943"]]
---
  def create
    @post = Post.new(post_params)
    @post.user = current_user

    byebug

    respond_to do |format|
      if @post.save